app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("action", "description", "created_at", "updated_at", "assignee") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["action", ""], ["description", ""], ["created_at", "2018-09-22 23:46:29.476785"], ["updated_at", "2018-09-22 23:46:29.476785"], ["assignee", ""]]
---
  def create
    filtered_task_params = task_params()
    @task = Task.new(filtered_task_params)

    is_successful_save = @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @task = Task.find_by(id: params[:id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def edit
    @task = Task.find_by(id: params[:id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = $1, "assignee" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["description", ""], ["assignee", "Cait Sith"], ["updated_at", "2018-09-23 00:48:11.832095"], ["id", 6]]
---
  def update
    filtered_task_params = task_params()
    @task = Task.find(params[:id])
    is_successful_update = @task.update(filtered_task_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 4]]
---
  def destroy
    @task = Task.find_by(id: params[:id])

    @task.destroy

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completed", true], ["updated_at", "2018-09-24 02:07:51.999866"], ["id", 3]]
UPDATE "tasks" SET "completed" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completed", false], ["updated_at", "2018-09-24 02:07:56.537870"], ["id", 3]]
---
  def toggle_complete
    @task = Task.find_by(id: params[:id])
    if @task.completed == false
      @task.completed = true
      @task.save
    else
      @task.completed = false
      @task.save