app/controllers/tasks_controller.rb

  def show
    task_id = params[:id].to_i
    @tasks = Task.all
---
SELECT "tasks".* FROM "tasks"